## Staging: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     RESOURCE                     |
|--------|--------------------------------------------------|
| add    | `aws_ecr_lifecycle_policy.blawx_expire_untagged` |
|        | `aws_ecr_repository.blawx_ecr`                   |
|        | `aws_ecr_repository_policy.blawx_policy`         |

| CHANGE |        OUTPUT         |
|--------|-----------------------|
| add    | `ecr_repository_url`  |
|        | `ecr_registry_id`     |
|        | `ecr_repository_arn`  |
|        | `ecr_repository_name` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.blawx_expire_untagged will be created
  + resource "aws_ecr_lifecycle_policy" "blawx_expire_untagged" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 14 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 14
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 any images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ca-central-1"
      + registry_id = (known after apply)
      + repository  = "blawx-staging"
    }

  # aws_ecr_repository.blawx_ecr will be created
  + resource "aws_ecr_repository" "blawx_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "blawx-staging"
      + region               = "ca-central-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-ecr"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-ecr"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.blawx_policy will be created
  + resource "aws_ecr_repository_policy" "blawx_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::278626299035:root"
                        }
                      + Sid       = "AllowPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "ca-central-1"
      + registry_id = (known after apply)
      + repository  = "blawx-staging"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_registry_id     = (known after apply)
  + ecr_repository_arn  = (known after apply)
  + ecr_repository_name = "blawx-staging"
  + ecr_repository_url  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
